app/controllers/application_controller.rb

  def current_user
    if token
      @actual_user ||= User.find(token[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]