app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts" WHERE "posts"."deleted_at" IS NULL

    def set_post
      @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."deleted_at" IS NULL AND "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]