app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" WHERE "posts"."deleted_at" IS NULL ORDER BY "posts"."date" DESC
---
  def index
    @posts = Post.all.order('date')